benchmark/logs/producer.log
SLF4J: Class path contains multiple SLF4J bindings.
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/core/build/dependant-libs-2.10.6/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/tools/build/dependant-libs-2.10.6/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/connect/api/build/dependant-libs/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/connect/runtime/build/dependant-libs/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/connect/file/build/dependant-libs/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: Found binding in [jar:file:/homes/hny9/chenxin/kafka/kafka-0.10.0.0-src/connect/json/build/dependant-libs/slf4j-log4j12-1.7.21.jar!/org/slf4j/impl/StaticLoggerBinder.class]
SLF4J: See http://www.slf4j.org/codes.html#multiple_bindings for an explanation.
SLF4J: Actual binding is of type [org.slf4j.impl.Log4jLoggerFactory]
[2016-07-07 15:49:48,918] WARN Error while fetching metadata with correlation id 0 : {ttt=LEADER_NOT_AVAILABLE} (org.apache.kafka.clients.NetworkClient)
07-07-2016 03:49:49: 6475 records sent, 6310.9 records/sec (6.02 MB/sec), 158.3 ms avg latency, 440.0 max latency.
07-07-2016 03:49:50: 21452 records sent, 21452.0 records/sec (20.46 MB/sec), 779.3 ms avg latency, 1055.0 max latency.
07-07-2016 03:49:51: 31403 records sent, 31403.0 records/sec (29.95 MB/sec), 1414.9 ms avg latency, 1779.0 max latency.
07-07-2016 03:49:52: 39370 records sent, 38980.2 records/sec (37.17 MB/sec), 1899.7 ms avg latency, 2073.0 max latency.
07-07-2016 03:49:53: 47213 records sent, 47213.0 records/sec (45.03 MB/sec), 1573.8 ms avg latency, 1760.0 max latency.
07-07-2016 03:49:54: 63488 records sent, 63488.0 records/sec (60.55 MB/sec), 1164.9 ms avg latency, 1409.0 max latency.
07-07-2016 03:49:55: 63116 records sent, 63116.0 records/sec (60.19 MB/sec), 1009.8 ms avg latency, 1035.0 max latency.
07-07-2016 03:49:56: 64542 records sent, 64542.0 records/sec (61.55 MB/sec), 1016.3 ms avg latency, 1036.0 max latency.
07-07-2016 03:49:57: 81158 records sent, 81158.0 records/sec (77.40 MB/sec), 863.7 ms avg latency, 1004.0 max latency.
07-07-2016 03:49:58: 96348 records sent, 96348.0 records/sec (91.88 MB/sec), 694.7 ms avg latency, 749.0 max latency.
07-07-2016 03:49:59: 90055 records sent, 90055.0 records/sec (85.88 MB/sec), 644.1 ms avg latency, 760.0 max latency.
07-07-2016 03:50:00: 102951 records sent, 102951.0 records/sec (98.18 MB/sec), 665.7 ms avg latency, 760.0 max latency.
07-07-2016 03:50:01: 22041 records sent, 21091.9 records/sec (20.11 MB/sec), 606.0 ms avg latency, 1450.0 max latency.
07-07-2016 03:50:03: 1209 records sent, 758.5 records/sec (0.72 MB/sec), 1887.0 ms avg latency, 3033.0 max latency.
07-07-2016 03:50:05: 85281 records sent, 50313.3 records/sec (47.98 MB/sec), 2417.8 ms avg latency, 3069.0 max latency.
07-07-2016 03:50:06: 1891 records sent, 1760.7 records/sec (1.68 MB/sec), 1470.2 ms avg latency, 2526.0 max latency.
07-07-2016 03:50:07: 91574 records sent, 91574.0 records/sec (87.33 MB/sec), 1988.5 ms avg latency, 2625.0 max latency.
07-07-2016 03:50:08: 107291 records sent, 107291.0 records/sec (102.32 MB/sec), 604.9 ms avg latency, 635.0 max latency.
07-07-2016 03:50:09: 99138 records sent, 99138.0 records/sec (94.55 MB/sec), 623.7 ms avg latency, 639.0 max latency.
07-07-2016 03:50:10: 94860 records sent, 94860.0 records/sec (90.47 MB/sec), 627.5 ms avg latency, 710.0 max latency.
07-07-2016 03:50:11: 96782 records sent, 96782.0 records/sec (92.30 MB/sec), 698.3 ms avg latency, 740.0 max latency.
07-07-2016 03:50:12: 107322 records sent, 107322.0 records/sec (102.35 MB/sec), 606.4 ms avg latency, 638.0 max latency.
07-07-2016 03:50:13: 101401 records sent, 101401.0 records/sec (96.70 MB/sec), 614.8 ms avg latency, 643.0 max latency.
07-07-2016 03:50:14: 102269 records sent, 102269.0 records/sec (97.53 MB/sec), 617.0 ms avg latency, 626.0 max latency.
07-07-2016 03:50:15: 18631 records sent, 18631.0 records/sec (17.77 MB/sec), 1274.6 ms avg latency, 1433.0 max latency.
07-07-2016 03:50:16: 107012 records sent, 107012.0 records/sec (102.05 MB/sec), 978.5 ms avg latency, 1447.0 max latency.
07-07-2016 03:50:17: 70928 records sent, 70645.4 records/sec (67.37 MB/sec), 881.7 ms avg latency, 925.0 max latency.
07-07-2016 03:50:18: 60543 records sent, 60543.0 records/sec (57.74 MB/sec), 669.3 ms avg latency, 1056.0 max latency.
07-07-2016 03:50:19: 96999 records sent, 88020.9 records/sec (83.94 MB/sec), 852.5 ms avg latency, 1069.0 max latency.
07-07-2016 03:50:20: 41385 records sent, 32484.3 records/sec (30.98 MB/sec), 772.6 ms avg latency, 1647.0 max latency.
07-07-2016 03:50:21: 93434 records sent, 93434.0 records/sec (89.11 MB/sec), 1315.1 ms avg latency, 1745.0 max latency.
07-07-2016 03:50:22: 106702 records sent, 106702.0 records/sec (101.76 MB/sec), 605.2 ms avg latency, 623.0 max latency.
07-07-2016 03:50:23: 106516 records sent, 106516.0 records/sec (101.58 MB/sec), 596.0 ms avg latency, 624.0 max latency.
07-07-2016 03:50:24: 108531 records sent, 108531.0 records/sec (103.50 MB/sec), 579.0 ms avg latency, 587.0 max latency.
07-07-2016 03:50:25: 110577 records sent, 110577.0 records/sec (105.45 MB/sec), 585.1 ms avg latency, 597.0 max latency.
07-07-2016 03:50:27: 45446 records sent, 25646.7 records/sec (24.46 MB/sec), 574.5 ms avg latency, 1932.0 max latency.
07-07-2016 03:50:28: 108283 records sent, 108283.0 records/sec (103.27 MB/sec), 1385.9 ms avg latency, 1959.0 max latency.
07-07-2016 03:50:29: 98146 records sent, 98146.0 records/sec (93.60 MB/sec), 637.8 ms avg latency, 678.0 max latency.
07-07-2016 03:50:30: 82460 records sent, 65340.7 records/sec (62.31 MB/sec), 595.2 ms avg latency, 1094.0 max latency.
07-07-2016 03:50:31: 1054 records sent, 984.1 records/sec (0.94 MB/sec), 1095.5 ms avg latency, 2156.0 max latency.
07-07-2016 03:50:32: 837 records sent, 785.2 records/sec (0.75 MB/sec), 2160.7 ms avg latency, 3216.0 max latency.
07-07-2016 03:50:34: 86893 records sent, 48354.5 records/sec (46.11 MB/sec), 2496.4 ms avg latency, 3252.0 max latency.
07-07-2016 03:50:35: 82150 records sent, 82150.0 records/sec (78.34 MB/sec), 1515.6 ms avg latency, 1802.0 max latency.
07-07-2016 03:50:36: 111600 records sent, 111600.0 records/sec (106.43 MB/sec), 579.0 ms avg latency, 587.0 max latency.
07-07-2016 03:50:37: 106454 records sent, 106454.0 records/sec (101.52 MB/sec), 587.3 ms avg latency, 607.0 max latency.
07-07-2016 03:50:38: 109802 records sent, 109802.0 records/sec (104.72 MB/sec), 581.1 ms avg latency, 604.0 max latency.
07-07-2016 03:50:39: 110329 records sent, 110329.0 records/sec (105.22 MB/sec), 582.0 ms avg latency, 589.0 max latency.
07-07-2016 03:50:40: 81685 records sent, 81685.0 records/sec (77.90 MB/sec), 767.5 ms avg latency, 838.0 max latency.
07-07-2016 03:50:42: 52514 records sent, 33131.9 records/sec (31.60 MB/sec), 575.0 ms avg latency, 1698.0 max latency.
07-07-2016 03:50:43: 49104 records sent, 49104.0 records/sec (46.83 MB/sec), 2007.3 ms avg latency, 2250.0 max latency.
07-07-2016 03:50:44: 84909 records sent, 56380.5 records/sec (53.77 MB/sec), 1016.0 ms avg latency, 2250.0 max latency.
07-07-2016 03:50:46: 67518 records sent, 43253.0 records/sec (41.25 MB/sec), 1239.3 ms avg latency, 1526.0 max latency.
07-07-2016 03:50:47: 103633 records sent, 103633.0 records/sec (98.83 MB/sec), 1198.2 ms avg latency, 1597.0 max latency.
07-07-2016 03:50:48: 12245 records sent, 11275.3 records/sec (10.75 MB/sec), 579.4 ms avg latency, 1558.0 max latency.
07-07-2016 03:50:49: 87916 records sent, 87916.0 records/sec (83.84 MB/sec), 1330.9 ms avg latency, 1613.0 max latency.
07-07-2016 03:50:50: 110515 records sent, 110515.0 records/sec (105.40 MB/sec), 654.8 ms avg latency, 740.0 max latency.
07-07-2016 03:50:51: 55893 records sent, 55893.0 records/sec (53.30 MB/sec), 888.9 ms avg latency, 1068.0 max latency.
07-07-2016 03:50:52: 106551 records sent, 106551.0 records/sec (101.61 MB/sec), 716.1 ms avg latency, 1082.0 max latency.
07-07-2016 03:50:53: 108062 records sent, 108062.0 records/sec (103.06 MB/sec), 581.5 ms avg latency, 606.0 max latency.
07-07-2016 03:50:54: 110732 records sent, 110732.0 records/sec (105.60 MB/sec), 586.4 ms avg latency, 600.0 max latency.
07-07-2016 03:50:55: 108500 records sent, 108500.0 records/sec (103.47 MB/sec), 577.9 ms avg latency, 589.0 max latency.
07-07-2016 03:50:56: 86955 records sent, 86955.0 records/sec (82.93 MB/sec), 716.4 ms avg latency, 807.0 max latency.
07-07-2016 03:50:57: 58838 records sent, 37168.7 records/sec (35.45 MB/sec), 607.7 ms avg latency, 1624.0 max latency.
07-07-2016 03:50:58: 105834 records sent, 105834.0 records/sec (100.93 MB/sec), 1225.0 ms avg latency, 1662.0 max latency.
07-07-2016 03:50:59: 47957 records sent, 47957.0 records/sec (45.74 MB/sec), 866.6 ms avg latency, 1153.0 max latency.
07-07-2016 03:51:01: 79794 records sent, 59370.5 records/sec (56.62 MB/sec), 877.9 ms avg latency, 1178.0 max latency.
07-07-2016 03:51:02: 108655 records sent, 108655.0 records/sec (103.62 MB/sec), 932.6 ms avg latency, 1188.0 max latency.
07-07-2016 03:51:03: 5487 records sent, 5390.0 records/sec (5.14 MB/sec), 575.6 ms avg latency, 1546.0 max latency.
07-07-2016 03:51:04: 1581 records sent, 1447.8 records/sec (1.38 MB/sec), 1880.7 ms avg latency, 2625.0 max latency.
07-07-2016 03:51:05: 26691 records sent, 26691.0 records/sec (25.45 MB/sec), 3371.9 ms avg latency, 3389.0 max latency.
07-07-2016 03:51:06: 75671 records sent, 75671.0 records/sec (72.17 MB/sec), 2059.2 ms avg latency, 3376.0 max latency.
07-07-2016 03:51:07: 109616 records sent, 109616.0 records/sec (104.54 MB/sec), 656.8 ms avg latency, 897.0 max latency.
07-07-2016 03:51:08: 110546 records sent, 110546.0 records/sec (105.42 MB/sec), 580.3 ms avg latency, 589.0 max latency.
07-07-2016 03:51:09: 109368 records sent, 109368.0 records/sec (104.30 MB/sec), 577.2 ms avg latency, 586.0 max latency.
07-07-2016 03:51:10: 106423 records sent, 106423.0 records/sec (101.49 MB/sec), 592.8 ms avg latency, 608.0 max latency.
07-07-2016 03:51:11: 107136 records sent, 107136.0 records/sec (102.17 MB/sec), 597.7 ms avg latency, 617.0 max latency.
07-07-2016 03:51:12: 42284 records sent, 35562.7 records/sec (33.92 MB/sec), 587.4 ms avg latency, 1377.0 max latency.
07-07-2016 03:51:13: 105648 records sent, 105648.0 records/sec (100.75 MB/sec), 1066.6 ms avg latency, 1379.0 max latency.
07-07-2016 03:51:14: 25110 records sent, 23036.7 records/sec (21.97 MB/sec), 637.3 ms avg latency, 1463.0 max latency.
07-07-2016 03:51:15: 107694 records sent, 107694.0 records/sec (102.71 MB/sec), 1099.2 ms avg latency, 1464.0 max latency.
07-07-2016 03:51:16: 72044 records sent, 72044.0 records/sec (68.71 MB/sec), 885.1 ms avg latency, 930.0 max latency.
07-07-2016 03:51:18: 70494 records sent, 46561.4 records/sec (44.40 MB/sec), 574.1 ms avg latency, 1437.0 max latency.
07-07-2016 03:51:19: 27528 records sent, 25071.0 records/sec (23.91 MB/sec), 1437.6 ms avg latency, 2292.0 max latency.
07-07-2016 03:51:20: 72974 records sent, 64923.5 records/sec (61.92 MB/sec), 1770.0 ms avg latency, 2326.0 max latency.
07-07-2016 03:51:21: 104129 records sent, 104129.0 records/sec (99.31 MB/sec), 857.4 ms avg latency, 1031.0 max latency.
07-07-2016 03:51:22: 110825 records sent, 110825.0 records/sec (105.69 MB/sec), 587.0 ms avg latency, 609.0 max latency.
07-07-2016 03:51:23: 108283 records sent, 108283.0 records/sec (103.27 MB/sec), 582.3 ms avg latency, 591.0 max latency.
07-07-2016 03:51:24: 111631 records sent, 111631.0 records/sec (106.46 MB/sec), 578.3 ms avg latency, 587.0 max latency.
07-07-2016 03:51:25: 88567 records sent, 66792.6 records/sec (63.70 MB/sec), 582.3 ms avg latency, 1090.0 max latency.
07-07-2016 03:51:27: 83049 records sent, 45086.3 records/sec (43.00 MB/sec), 962.8 ms avg latency, 1671.0 max latency.
07-07-2016 03:51:28: 107911 records sent, 107911.0 records/sec (102.91 MB/sec), 1221.5 ms avg latency, 1679.0 max latency.
07-07-2016 03:51:29: 74772 records sent, 74772.0 records/sec (71.31 MB/sec), 857.5 ms avg latency, 912.0 max latency.
07-07-2016 03:51:30: 34472 records sent, 30614.6 records/sec (29.20 MB/sec), 598.9 ms avg latency, 1398.0 max latency.
07-07-2016 03:51:32: 713 records sent, 394.4 records/sec (0.38 MB/sec), 2222.4 ms avg latency, 3201.0 max latency.
07-07-2016 03:51:34: 86335 records sent, 49904.6 records/sec (47.59 MB/sec), 2505.6 ms avg latency, 3234.0 max latency.
07-07-2016 03:51:35: 95201 records sent, 95201.0 records/sec (90.79 MB/sec), 1276.7 ms avg latency, 1637.0 max latency.
07-07-2016 03:51:36: 91109 records sent, 85548.4 records/sec (81.59 MB/sec), 578.1 ms avg latency, 806.0 max latency.
07-07-2016 03:51:37: 110298 records sent, 110298.0 records/sec (105.19 MB/sec), 707.1 ms avg latency, 809.0 max latency.
07-07-2016 03:51:38: 109120 records sent, 109120.0 records/sec (104.06 MB/sec), 587.2 ms avg latency, 612.0 max latency.
07-07-2016 03:51:39: 101990 records sent, 101990.0 records/sec (97.27 MB/sec), 592.9 ms avg latency, 646.0 max latency.
07-07-2016 03:51:40: 70339 records sent, 70339.0 records/sec (67.08 MB/sec), 661.5 ms avg latency, 941.0 max latency.
07-07-2016 03:51:41: 105524 records sent, 61279.9 records/sec (58.44 MB/sec), 764.6 ms avg latency, 1337.0 max latency.
07-07-2016 03:51:42: 109430 records sent, 109430.0 records/sec (104.36 MB/sec), 1027.6 ms avg latency, 1358.0 max latency.
07-07-2016 03:51:43: 85064 records sent, 85064.0 records/sec (81.12 MB/sec), 738.5 ms avg latency, 796.0 max latency.
07-07-2016 03:51:45: 74741 records sent, 46683.9 records/sec (44.52 MB/sec), 579.1 ms avg latency, 1502.0 max latency.
07-07-2016 03:51:46: 92287 records sent, 64990.8 records/sec (61.98 MB/sec), 1219.4 ms avg latency, 1520.0 max latency.
07-07-2016 03:51:47: 107229 records sent, 107229.0 records/sec (102.26 MB/sec), 925.2 ms avg latency, 1168.0 max latency.
07-07-2016 03:51:48: 105586 records sent, 105586.0 records/sec (100.69 MB/sec), 595.4 ms avg latency, 625.0 max latency.
07-07-2016 03:51:49: 106237 records sent, 106237.0 records/sec (101.32 MB/sec), 596.4 ms avg latency, 624.0 max latency.
07-07-2016 03:51:50: 107663 records sent, 107663.0 records/sec (102.68 MB/sec), 598.2 ms avg latency, 624.0 max latency.
07-07-2016 03:51:51: 107415 records sent, 107415.0 records/sec (102.44 MB/sec), 590.8 ms avg latency, 600.0 max latency.
07-07-2016 03:51:54: 86273 records sent, 29018.8 records/sec (27.67 MB/sec), 580.3 ms avg latency, 2772.0 max latency.
07-07-2016 03:51:55: 46283 records sent, 46283.0 records/sec (44.14 MB/sec), 3044.3 ms avg latency, 3341.0 max latency.
07-07-2016 03:51:57: 67394 records sent, 60715.3 records/sec (57.90 MB/sec), 1484.0 ms avg latency, 3341.0 max latency.
07-07-2016 03:51:58: 111631 records sent, 111631.0 records/sec (106.46 MB/sec), 859.8 ms avg latency, 1077.0 max latency.
07-07-2016 03:51:59: 78368 records sent, 78368.0 records/sec (74.74 MB/sec), 785.8 ms avg latency, 870.0 max latency.
07-07-2016 03:52:00: 76446 records sent, 41569.3 records/sec (39.64 MB/sec), 608.3 ms avg latency, 1710.0 max latency.
07-07-2016 03:52:01: 109740 records sent, 109740.0 records/sec (104.66 MB/sec), 1232.3 ms avg latency, 1713.0 max latency.
07-07-2016 03:52:02: 87544 records sent, 87544.0 records/sec (83.49 MB/sec), 711.1 ms avg latency, 791.0 max latency.
07-07-2016 03:52:03: 107632 records sent, 107632.0 records/sec (102.65 MB/sec), 599.6 ms avg latency, 789.0 max latency.
07-07-2016 03:52:04: 109864 records sent, 109864.0 records/sec (104.77 MB/sec), 578.1 ms avg latency, 597.0 max latency.
07-07-2016 03:52:05: 110391 records sent, 110391.0 records/sec (105.28 MB/sec), 580.6 ms avg latency, 588.0 max latency.
07-07-2016 03:52:07: 66898 records sent, 42340.5 records/sec (40.38 MB/sec), 575.1 ms avg latency, 1551.0 max latency.
07-07-2016 03:52:08: 73625 records sent, 73625.0 records/sec (70.21 MB/sec), 1698.3 ms avg latency, 1888.0 max latency.
07-07-2016 03:52:09: 50003 records sent, 41053.4 records/sec (39.15 MB/sec), 597.8 ms avg latency, 1337.0 max latency.
07-07-2016 03:52:10: 109988 records sent, 109988.0 records/sec (104.89 MB/sec), 1008.8 ms avg latency, 1339.0 max latency.
07-07-2016 03:52:11: 42129 records sent, 42129.0 records/sec (40.18 MB/sec), 960.2 ms avg latency, 1191.0 max latency.
07-07-2016 03:52:13: 86490 records sent, 50966.4 records/sec (48.61 MB/sec), 846.2 ms avg latency, 1480.0 max latency.
07-07-2016 03:52:15: 1395 records sent, 817.7 records/sec (0.78 MB/sec), 1881.2 ms avg latency, 3174.0 max latency.
07-07-2016 03:52:16: 91822 records sent, 82797.1 records/sec (78.96 MB/sec), 2363.0 ms avg latency, 3190.0 max latency.
07-07-2016 03:52:17: 108407 records sent, 108407.0 records/sec (103.38 MB/sec), 738.1 ms avg latency, 858.0 max latency.
07-07-2016 03:52:18: 111631 records sent, 111631.0 records/sec (106.46 MB/sec), 575.9 ms avg latency, 579.0 max latency.
07-07-2016 03:52:19: 104408 records sent, 104408.0 records/sec (99.57 MB/sec), 598.7 ms avg latency, 619.0 max latency.
07-07-2016 03:52:20: 107415 records sent, 107415.0 records/sec (102.44 MB/sec), 584.2 ms avg latency, 602.0 max latency.
07-07-2016 03:52:21: 111662 records sent, 111662.0 records/sec (106.49 MB/sec), 581.5 ms avg latency, 598.0 max latency.
07-07-2016 03:52:22: 75733 records sent, 75733.0 records/sec (72.22 MB/sec), 725.5 ms avg latency, 893.0 max latency.
07-07-2016 03:52:23: 86645 records sent, 62650.0 records/sec (59.75 MB/sec), 682.2 ms avg latency, 1153.0 max latency.
07-07-2016 03:52:25: 99820 records sent, 68557.7 records/sec (65.38 MB/sec), 946.2 ms avg latency, 1154.0 max latency.
07-07-2016 03:52:26: 61070 records sent, 61070.0 records/sec (58.24 MB/sec), 1423.4 ms avg latency, 1584.0 max latency.
07-07-2016 03:52:27: 90520 records sent, 90520.0 records/sec (86.33 MB/sec), 724.4 ms avg latency, 1579.0 max latency.
07-07-2016 03:52:28: 108562 records sent, 108562.0 records/sec (103.53 MB/sec), 670.2 ms avg latency, 757.0 max latency.
07-07-2016 03:52:29: 85033 records sent, 85033.0 records/sec (81.09 MB/sec), 697.9 ms avg latency, 810.0 max latency.
07-07-2016 03:52:30: 47771 records sent, 24560.9 records/sec (23.42 MB/sec), 681.0 ms avg latency, 2089.0 max latency.
07-07-2016 03:52:31: 108655 records sent, 108438.1 records/sec (103.41 MB/sec), 1459.9 ms avg latency, 2091.0 max latency.
07-07-2016 03:52:32: 111693 records sent, 111693.0 records/sec (106.52 MB/sec), 574.7 ms avg latency, 576.0 max latency.
07-07-2016 03:52:33: 106733 records sent, 106733.0 records/sec (101.79 MB/sec), 587.6 ms avg latency, 600.0 max latency.
07-07-2016 03:52:35: 101990 records sent, 55010.8 records/sec (52.46 MB/sec), 584.1 ms avg latency, 1506.0 max latency.
07-07-2016 03:52:36: 85374 records sent, 85374.0 records/sec (81.42 MB/sec), 1395.6 ms avg latency, 1724.0 max latency.
07-07-2016 03:52:37: 37913 records sent, 32768.4 records/sec (31.25 MB/sec), 644.8 ms avg latency, 1398.0 max latency.
07-07-2016 03:52:39: 60047 records sent, 60047.0 records/sec (57.27 MB/sec), 1612.3 ms avg latency, 1855.0 max latency.
07-07-2016 03:52:40: 105307 records sent, 103648.6 records/sec (98.85 MB/sec), 786.5 ms avg latency, 1866.0 max latency.
07-07-2016 03:52:41: 58249 records sent, 58249.0 records/sec (55.55 MB/sec), 816.4 ms avg latency, 1064.0 max latency.
07-07-2016 03:52:42: 63488 records sent, 60987.5 records/sec (58.16 MB/sec), 840.8 ms avg latency, 1064.0 max latency.
07-07-2016 03:52:43: 1240 records sent, 1172.0 records/sec (1.12 MB/sec), 1042.0 ms avg latency, 2089.0 max latency.
07-07-2016 03:52:44: 83452 records sent, 83452.0 records/sec (79.59 MB/sec), 1890.3 ms avg latency, 2325.0 max latency.
07-07-2016 03:52:45: 111290 records sent, 111290.0 records/sec (106.13 MB/sec), 581.3 ms avg latency, 799.0 max latency.
07-07-2016 03:52:46: 106392 records sent, 105968.1 records/sec (101.06 MB/sec), 583.7 ms avg latency, 597.0 max latency.
07-07-2016 03:52:47: 107911 records sent, 107911.0 records/sec (102.91 MB/sec), 602.5 ms avg latency, 617.0 max latency.
07-07-2016 03:52:48: 103137 records sent, 103137.0 records/sec (98.36 MB/sec), 606.7 ms avg latency, 622.0 max latency.
07-07-2016 03:52:49: 105648 records sent, 104498.5 records/sec (99.66 MB/sec), 602.3 ms avg latency, 606.0 max latency.
07-07-2016 03:52:50: 248 records sent, 191.5 records/sec (0.18 MB/sec), 609.2 ms avg latency, 1897.0 max latency.
07-07-2016 03:52:51: 77283 records sent, 76745.8 records/sec (73.19 MB/sec), 1801.0 ms avg latency, 2179.0 max latency.
07-07-2016 03:52:52: 75392 records sent, 75392.0 records/sec (71.90 MB/sec), 745.0 ms avg latency, 907.0 max latency.
07-07-2016 03:52:54: 107291 records sent, 52235.2 records/sec (49.82 MB/sec), 725.8 ms avg latency, 1668.0 max latency.
07-07-2016 03:52:56: 66712 records sent, 39615.2 records/sec (37.78 MB/sec), 1762.3 ms avg latency, 1889.0 max latency.
07-07-2016 03:52:57: 4867 records sent, 3266.4 records/sec (3.12 MB/sec), 1986.6 ms avg latency, 3062.0 max latency.
07-07-2016 03:52:58: 81530 records sent, 81205.2 records/sec (77.44 MB/sec), 2444.2 ms avg latency, 3069.0 max latency.
07-07-2016 03:52:59: 71343 records sent, 71343.0 records/sec (68.04 MB/sec), 818.3 ms avg latency, 897.0 max latency.
07-07-2016 03:53:00: 57679 records sent, 57679.0 records/sec (55.01 MB/sec), 1054.5 ms avg latency, 1146.0 max latency.
07-07-2016 03:53:01: 86056 records sent, 86056.0 records/sec (82.07 MB/sec), 877.9 ms avg latency, 1167.0 max latency.
07-07-2016 03:53:02: 102672 records sent, 102672.0 records/sec (97.92 MB/sec), 643.6 ms avg latency, 701.0 max latency.
07-07-2016 03:53:03: 103943 records sent, 103943.0 records/sec (99.13 MB/sec), 594.5 ms avg latency, 619.0 max latency.
07-07-2016 03:53:04: 105741 records sent, 105741.0 records/sec (100.84 MB/sec), 609.7 ms avg latency, 622.0 max latency.
07-07-2016 03:53:05: 99045 records sent, 77926.8 records/sec (74.32 MB/sec), 620.1 ms avg latency, 917.0 max latency.
07-07-2016 03:53:06: 12710 records sent, 12710.0 records/sec (12.12 MB/sec), 1580.5 ms avg latency, 1800.0 max latency.
07-07-2016 03:53:08: 64449 records sent, 42512.5 records/sec (40.54 MB/sec), 1582.7 ms avg latency, 1802.0 max latency.
07-07-2016 03:53:09: 93527 records sent, 93340.3 records/sec (89.02 MB/sec), 1281.6 ms avg latency, 1605.0 max latency.
07-07-2016 03:53:11: 40083 records sent, 21196.7 records/sec (20.21 MB/sec), 779.7 ms avg latency, 2124.0 max latency.
07-07-2016 03:53:12: 1581 records sent, 1432.1 records/sec (1.37 MB/sec), 2589.7 ms avg latency, 3213.0 max latency.
07-07-2016 03:53:13: 217 records sent, 192.4 records/sec (0.18 MB/sec), 4041.0 ms avg latency, 4340.0 max latency.
07-07-2016 03:53:14: 95139 records sent, 95139.0 records/sec (90.73 MB/sec), 3035.4 ms avg latency, 4387.0 max latency.
07-07-2016 03:53:15: 23994 records sent, 21028.9 records/sec (20.05 MB/sec), 644.6 ms avg latency, 1541.0 max latency.
07-07-2016 03:53:16: 35712 records sent, 35712.0 records/sec (34.06 MB/sec), 2086.1 ms avg latency, 2180.0 max latency.
07-07-2016 03:53:17: 77717 records sent, 77717.0 records/sec (74.12 MB/sec), 1346.2 ms avg latency, 2284.0 max latency.
07-07-2016 03:53:18: 81995 records sent, 81995.0 records/sec (78.20 MB/sec), 775.2 ms avg latency, 813.0 max latency.
07-07-2016 03:53:19: 97123 records sent, 97123.0 records/sec (92.62 MB/sec), 713.2 ms avg latency, 788.0 max latency.
07-07-2016 03:53:20: 95852 records sent, 94621.9 records/sec (90.24 MB/sec), 614.8 ms avg latency, 683.0 max latency.
07-07-2016 03:53:21: 105679 records sent, 105679.0 records/sec (100.78 MB/sec), 656.0 ms avg latency, 698.0 max latency.
07-07-2016 03:53:22: 102610 records sent, 102610.0 records/sec (97.86 MB/sec), 608.7 ms avg latency, 626.0 max latency.
07-07-2016 03:53:23: 106237 records sent, 106237.0 records/sec (101.32 MB/sec), 608.0 ms avg latency, 623.0 max latency.
07-07-2016 03:53:25: 68386 records sent, 43558.0 records/sec (41.54 MB/sec), 690.9 ms avg latency, 1514.0 max latency.
07-07-2016 03:53:26: 73067 records sent, 73067.0 records/sec (69.68 MB/sec), 1583.7 ms avg latency, 1813.0 max latency.
07-07-2016 03:53:27: 44950 records sent, 44950.0 records/sec (42.87 MB/sec), 678.6 ms avg latency, 1175.0 max latency.
07-07-2016 03:53:29: 104470 records sent, 52261.1 records/sec (49.84 MB/sec), 918.0 ms avg latency, 1603.0 max latency.
07-07-2016 03:53:30: 45725 records sent, 38359.9 records/sec (36.58 MB/sec), 2089.6 ms avg latency, 2373.0 max latency.
07-07-2016 03:53:31: 100099 records sent, 100099.0 records/sec (95.46 MB/sec), 1068.5 ms avg latency, 2381.0 max latency.
07-07-2016 03:53:32: 24924 records sent, 20598.3 records/sec (19.64 MB/sec), 614.4 ms avg latency, 1583.0 max latency.
07-07-2016 03:53:33: 46717 records sent, 46717.0 records/sec (44.55 MB/sec), 2053.6 ms avg latency, 2137.0 max latency.
07-07-2016 03:53:34: 94550 records sent, 94550.0 records/sec (90.17 MB/sec), 986.0 ms avg latency, 2184.0 max latency.
07-07-2016 03:53:35: 104935 records sent, 104935.0 records/sec (100.07 MB/sec), 603.7 ms avg latency, 645.0 max latency.
07-07-2016 03:53:36: 104160 records sent, 104160.0 records/sec (99.33 MB/sec), 610.6 ms avg latency, 628.0 max latency.
07-07-2016 03:53:37: 104439 records sent, 104439.0 records/sec (99.60 MB/sec), 605.8 ms avg latency, 625.0 max latency.
16000000 records sent, 69686.714663 records/sec (66.46 MB/sec), 905.63 ms avg latency, 4387.00 ms max latency, 610 ms 50th, 2102 ms 95th, 3325 ms 99th, 4371 ms 99.9th.